loadtest/results/03-chat-list-and-history.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /root/Mento/loadtest/k6/03-chat-list-and-history.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 3m30s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 3m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 005/200 VUs, 1 complete and 0 interrupted iterations
default   [   0% ] 005/200 VUs  0m00.8s/3m00.0s

running (0m02.0s), 012/200 VUs, 5 complete and 0 interrupted iterations
default   [   1% ] 012/200 VUs  0m01.7s/3m00.0s

running (0m03.0s), 019/200 VUs, 11 complete and 0 interrupted iterations
default   [   2% ] 019/200 VUs  0m02.7s/3m00.0s

running (0m04.0s), 025/200 VUs, 23 complete and 0 interrupted iterations
default   [   2% ] 025/200 VUs  0m03.8s/3m00.0s

running (0m05.0s), 032/200 VUs, 37 complete and 0 interrupted iterations
default   [   3% ] 032/200 VUs  0m04.8s/3m00.0s

running (0m06.0s), 039/200 VUs, 56 complete and 0 interrupted iterations
default   [   3% ] 039/200 VUs  0m05.7s/3m00.0s

running (0m07.0s), 045/200 VUs, 77 complete and 0 interrupted iterations
default   [   4% ] 045/200 VUs  0m06.8s/3m00.0s

running (0m08.0s), 052/200 VUs, 105 complete and 0 interrupted iterations
default   [   4% ] 052/200 VUs  0m07.8s/3m00.0s

running (0m09.0s), 059/200 VUs, 135 complete and 0 interrupted iterations
default   [   5% ] 059/200 VUs  0m08.8s/3m00.0s

running (0m10.0s), 065/200 VUs, 174 complete and 0 interrupted iterations
default   [   5% ] 065/200 VUs  0m09.7s/3m00.0s

running (0m11.0s), 072/200 VUs, 209 complete and 0 interrupted iterations
default   [   6% ] 072/200 VUs  0m10.8s/3m00.0s

running (0m12.0s), 078/200 VUs, 257 complete and 0 interrupted iterations
default   [   7% ] 078/200 VUs  0m11.8s/3m00.0s

running (0m13.0s), 085/200 VUs, 297 complete and 0 interrupted iterations
default   [   7% ] 085/200 VUs  0m12.8s/3m00.0s

running (0m14.0s), 092/200 VUs, 352 complete and 0 interrupted iterations
default   [   8% ] 092/200 VUs  0m13.8s/3m00.0s

running (0m15.0s), 098/200 VUs, 405 complete and 0 interrupted iterations
default   [   8% ] 098/200 VUs  0m14.7s/3m00.0s

running (0m16.0s), 105/200 VUs, 475 complete and 0 interrupted iterations
default   [   9% ] 105/200 VUs  0m15.8s/3m00.0s

running (0m17.0s), 112/200 VUs, 533 complete and 0 interrupted iterations
default   [   9% ] 112/200 VUs  0m16.8s/3m00.0s

running (0m18.0s), 118/200 VUs, 603 complete and 0 interrupted iterations
default   [  10% ] 118/200 VUs  0m17.8s/3m00.0s

running (0m19.0s), 125/200 VUs, 671 complete and 0 interrupted iterations
default   [  10% ] 125/200 VUs  0m18.8s/3m00.0s

running (0m20.0s), 132/200 VUs, 758 complete and 0 interrupted iterations
default   [  11% ] 132/200 VUs  0m19.7s/3m00.0s

running (0m21.0s), 138/200 VUs, 832 complete and 0 interrupted iterations
default   [  12% ] 138/200 VUs  0m20.8s/3m00.0s

running (0m22.0s), 145/200 VUs, 912 complete and 0 interrupted iterations
default   [  12% ] 145/200 VUs  0m21.7s/3m00.0s

running (0m23.0s), 151/200 VUs, 1005 complete and 0 interrupted iterations
default   [  13% ] 151/200 VUs  0m22.8s/3m00.0s

running (0m24.0s), 158/200 VUs, 1093 complete and 0 interrupted iterations
default   [  13% ] 158/200 VUs  0m23.7s/3m00.0s

running (0m25.0s), 165/200 VUs, 1182 complete and 0 interrupted iterations
default   [  14% ] 165/200 VUs  0m24.8s/3m00.0s

running (0m26.0s), 171/200 VUs, 1294 complete and 0 interrupted iterations
default   [  14% ] 171/200 VUs  0m25.8s/3m00.0s

running (0m27.0s), 178/200 VUs, 1399 complete and 0 interrupted iterations
default   [  15% ] 178/200 VUs  0m26.7s/3m00.0s

running (0m28.0s), 185/200 VUs, 1500 complete and 0 interrupted iterations
default   [  15% ] 185/200 VUs  0m27.8s/3m00.0s

running (0m29.0s), 191/200 VUs, 1608 complete and 0 interrupted iterations
default   [  16% ] 191/200 VUs  0m28.8s/3m00.0s

running (0m30.0s), 198/200 VUs, 1731 complete and 0 interrupted iterations
default   [  17% ] 198/200 VUs  0m29.8s/3m00.0s

running (0m31.0s), 200/200 VUs, 1850 complete and 0 interrupted iterations
default   [  17% ] 200/200 VUs  0m30.7s/3m00.0s

running (0m32.0s), 200/200 VUs, 1986 complete and 0 interrupted iterations
default   [  18% ] 200/200 VUs  0m31.8s/3m00.0s

running (0m33.0s), 200/200 VUs, 2108 complete and 0 interrupted iterations
default   [  18% ] 200/200 VUs  0m32.7s/3m00.0s

running (0m34.0s), 200/200 VUs, 2236 complete and 0 interrupted iterations
default   [  19% ] 200/200 VUs  0m33.7s/3m00.0s

running (0m35.0s), 200/200 VUs, 2362 complete and 0 interrupted iterations
default   [  19% ] 200/200 VUs  0m34.8s/3m00.0s

running (0m36.0s), 200/200 VUs, 2481 complete and 0 interrupted iterations
default   [  20% ] 200/200 VUs  0m35.8s/3m00.0s

running (0m37.0s), 200/200 VUs, 2603 complete and 0 interrupted iterations
default   [  20% ] 200/200 VUs  0m36.7s/3m00.0s

running (0m38.0s), 200/200 VUs, 2729 complete and 0 interrupted iterations
default   [  21% ] 200/200 VUs  0m37.8s/3m00.0s

running (0m39.0s), 200/200 VUs, 2851 complete and 0 interrupted iterations
default   [  22% ] 200/200 VUs  0m38.8s/3m00.0s

running (0m40.0s), 200/200 VUs, 2961 complete and 0 interrupted iterations
default   [  22% ] 200/200 VUs  0m39.7s/3m00.0s

running (0m41.0s), 200/200 VUs, 3089 complete and 0 interrupted iterations
default   [  23% ] 200/200 VUs  0m40.8s/3m00.0s

running (0m42.0s), 200/200 VUs, 3214 complete and 0 interrupted iterations
default   [  23% ] 200/200 VUs  0m41.8s/3m00.0s

running (0m43.0s), 200/200 VUs, 3343 complete and 0 interrupted iterations
default   [  24% ] 200/200 VUs  0m42.8s/3m00.0s

running (0m44.0s), 200/200 VUs, 3454 complete and 0 interrupted iterations
default   [  24% ] 200/200 VUs  0m43.7s/3m00.0s

running (0m45.0s), 200/200 VUs, 3589 complete and 0 interrupted iterations
default   [  25% ] 200/200 VUs  0m44.7s/3m00.0s

running (0m46.0s), 200/200 VUs, 3715 complete and 0 interrupted iterations
default   [  25% ] 200/200 VUs  0m45.8s/3m00.0s

running (0m47.0s), 200/200 VUs, 3845 complete and 0 interrupted iterations
default   [  26% ] 200/200 VUs  0m46.8s/3m00.0s

running (0m48.0s), 200/200 VUs, 3956 complete and 0 interrupted iterations
default   [  27% ] 200/200 VUs  0m47.7s/3m00.0s

running (0m49.0s), 200/200 VUs, 4090 complete and 0 interrupted iterations
default   [  27% ] 200/200 VUs  0m48.8s/3m00.0s

running (0m50.0s), 200/200 VUs, 4199 complete and 0 interrupted iterations
default   [  28% ] 200/200 VUs  0m49.8s/3m00.0s

running (0m51.0s), 200/200 VUs, 4332 complete and 0 interrupted iterations
default   [  28% ] 200/200 VUs  0m50.8s/3m00.0s

running (0m52.0s), 200/200 VUs, 4457 complete and 0 interrupted iterations
default   [  29% ] 200/200 VUs  0m51.8s/3m00.0s

running (0m53.0s), 200/200 VUs, 4575 complete and 0 interrupted iterations
default   [  29% ] 200/200 VUs  0m52.8s/3m00.0s

running (0m54.0s), 200/200 VUs, 4707 complete and 0 interrupted iterations
default   [  30% ] 200/200 VUs  0m53.7s/3m00.0s

running (0m55.0s), 200/200 VUs, 4827 complete and 0 interrupted iterations
default   [  30% ] 200/200 VUs  0m54.7s/3m00.0s

running (0m56.0s), 200/200 VUs, 4946 complete and 0 interrupted iterations
default   [  31% ] 200/200 VUs  0m55.8s/3m00.0s

running (0m57.0s), 200/200 VUs, 5072 complete and 0 interrupted iterations
default   [  32% ] 200/200 VUs  0m56.8s/3m00.0s

running (0m58.0s), 200/200 VUs, 5203 complete and 0 interrupted iterations
default   [  32% ] 200/200 VUs  0m57.8s/3m00.0s

running (0m59.0s), 200/200 VUs, 5324 complete and 0 interrupted iterations
default   [  33% ] 200/200 VUs  0m58.7s/3m00.0s

running (1m00.0s), 200/200 VUs, 5462 complete and 0 interrupted iterations
default   [  33% ] 200/200 VUs  0m59.8s/3m00.0s

running (1m01.0s), 200/200 VUs, 5581 complete and 0 interrupted iterations
default   [  34% ] 200/200 VUs  1m00.7s/3m00.0s

running (1m02.0s), 200/200 VUs, 5706 complete and 0 interrupted iterations
default   [  34% ] 200/200 VUs  1m01.7s/3m00.0s

running (1m03.0s), 200/200 VUs, 5833 complete and 0 interrupted iterations
default   [  35% ] 200/200 VUs  1m02.7s/3m00.0s

running (1m04.0s), 200/200 VUs, 5960 complete and 0 interrupted iterations
default   [  35% ] 200/200 VUs  1m03.8s/3m00.0s

running (1m05.0s), 200/200 VUs, 6079 complete and 0 interrupted iterations
default   [  36% ] 200/200 VUs  1m04.7s/3m00.0s

running (1m06.0s), 200/200 VUs, 6200 complete and 0 interrupted iterations
default   [  37% ] 200/200 VUs  1m05.7s/3m00.0s

running (1m07.0s), 200/200 VUs, 6337 complete and 0 interrupted iterations
default   [  37% ] 200/200 VUs  1m06.7s/3m00.0s

running (1m08.0s), 200/200 VUs, 6454 complete and 0 interrupted iterations
default   [  38% ] 200/200 VUs  1m07.8s/3m00.0s

running (1m09.0s), 200/200 VUs, 6578 complete and 0 interrupted iterations
default   [  38% ] 200/200 VUs  1m08.8s/3m00.0s

running (1m10.0s), 200/200 VUs, 6702 complete and 0 interrupted iterations
default   [  39% ] 200/200 VUs  1m09.8s/3m00.0s

running (1m11.0s), 200/200 VUs, 6817 complete and 0 interrupted iterations
default   [  39% ] 200/200 VUs  1m10.7s/3m00.0s

running (1m12.0s), 200/200 VUs, 6932 complete and 0 interrupted iterations
default   [  40% ] 200/200 VUs  1m11.8s/3m00.0s

running (1m13.0s), 200/200 VUs, 7061 complete and 0 interrupted iterations
default   [  40% ] 200/200 VUs  1m12.8s/3m00.0s

running (1m14.0s), 200/200 VUs, 7186 complete and 0 interrupted iterations
default   [  41% ] 200/200 VUs  1m13.8s/3m00.0s

running (1m15.0s), 200/200 VUs, 7323 complete and 0 interrupted iterations
default   [  42% ] 200/200 VUs  1m14.7s/3m00.0s

running (1m16.0s), 200/200 VUs, 7451 complete and 0 interrupted iterations
default   [  42% ] 200/200 VUs  1m15.8s/3m00.0s

running (1m17.0s), 200/200 VUs, 7575 complete and 0 interrupted iterations
default   [  43% ] 200/200 VUs  1m16.8s/3m00.0s

running (1m18.0s), 200/200 VUs, 7700 complete and 0 interrupted iterations
default   [  43% ] 200/200 VUs  1m17.8s/3m00.0s

running (1m19.0s), 200/200 VUs, 7827 complete and 0 interrupted iterations
default   [  44% ] 200/200 VUs  1m18.7s/3m00.0s

running (1m20.0s), 200/200 VUs, 7948 complete and 0 interrupted iterations
default   [  44% ] 200/200 VUs  1m19.7s/3m00.0s

running (1m21.0s), 200/200 VUs, 8081 complete and 0 interrupted iterations
default   [  45% ] 200/200 VUs  1m20.7s/3m00.0s

running (1m22.0s), 200/200 VUs, 8204 complete and 0 interrupted iterations
default   [  45% ] 200/200 VUs  1m21.7s/3m00.0s

running (1m23.0s), 200/200 VUs, 8337 complete and 0 interrupted iterations
default   [  46% ] 200/200 VUs  1m22.8s/3m00.0s

running (1m24.0s), 200/200 VUs, 8455 complete and 0 interrupted iterations
default   [  47% ] 200/200 VUs  1m23.8s/3m00.0s

running (1m25.0s), 200/200 VUs, 8586 complete and 0 interrupted iterations
default   [  47% ] 200/200 VUs  1m24.8s/3m00.0s

running (1m26.0s), 200/200 VUs, 8715 complete and 0 interrupted iterations
default   [  48% ] 200/200 VUs  1m25.7s/3m00.0s

running (1m27.0s), 200/200 VUs, 8836 complete and 0 interrupted iterations
default   [  48% ] 200/200 VUs  1m26.8s/3m00.0s

running (1m28.0s), 200/200 VUs, 8964 complete and 0 interrupted iterations
default   [  49% ] 200/200 VUs  1m27.7s/3m00.0s

running (1m29.0s), 200/200 VUs, 9090 complete and 0 interrupted iterations
default   [  49% ] 200/200 VUs  1m28.8s/3m00.0s

running (1m30.0s), 200/200 VUs, 9208 complete and 0 interrupted iterations
default   [  50% ] 200/200 VUs  1m29.8s/3m00.0s

running (1m31.0s), 200/200 VUs, 9325 complete and 0 interrupted iterations
default   [  50% ] 200/200 VUs  1m30.7s/3m00.0s

running (1m32.0s), 200/200 VUs, 9445 complete and 0 interrupted iterations
default   [  51% ] 200/200 VUs  1m31.8s/3m00.0s

running (1m33.0s), 200/200 VUs, 9569 complete and 0 interrupted iterations
default   [  52% ] 200/200 VUs  1m32.8s/3m00.0s

running (1m34.0s), 200/200 VUs, 9684 complete and 0 interrupted iterations
default   [  52% ] 200/200 VUs  1m33.8s/3m00.0s

running (1m35.0s), 200/200 VUs, 9811 complete and 0 interrupted iterations
default   [  53% ] 200/200 VUs  1m34.8s/3m00.0s

running (1m36.0s), 200/200 VUs, 9944 complete and 0 interrupted iterations
default   [  53% ] 200/200 VUs  1m35.8s/3m00.0s

running (1m37.0s), 200/200 VUs, 10055 complete and 0 interrupted iterations
default   [  54% ] 200/200 VUs  1m36.7s/3m00.0s

running (1m38.0s), 200/200 VUs, 10189 complete and 0 interrupted iterations
default   [  54% ] 200/200 VUs  1m37.7s/3m00.0s

running (1m39.0s), 200/200 VUs, 10322 complete and 0 interrupted iterations
default   [  55% ] 200/200 VUs  1m38.7s/3m00.0s

running (1m40.0s), 200/200 VUs, 10442 complete and 0 interrupted iterations
default   [  55% ] 200/200 VUs  1m39.7s/3m00.0s

running (1m41.0s), 200/200 VUs, 10564 complete and 0 interrupted iterations
default   [  56% ] 200/200 VUs  1m40.8s/3m00.0s

running (1m42.0s), 200/200 VUs, 10696 complete and 0 interrupted iterations
default   [  57% ] 200/200 VUs  1m41.8s/3m00.0s

running (1m43.0s), 200/200 VUs, 10825 complete and 0 interrupted iterations
default   [  57% ] 200/200 VUs  1m42.8s/3m00.0s

running (1m44.0s), 200/200 VUs, 10948 complete and 0 interrupted iterations
default   [  58% ] 200/200 VUs  1m43.7s/3m00.0s

running (1m45.0s), 200/200 VUs, 11067 complete and 0 interrupted iterations
default   [  58% ] 200/200 VUs  1m44.8s/3m00.0s

running (1m46.0s), 200/200 VUs, 11200 complete and 0 interrupted iterations
default   [  59% ] 200/200 VUs  1m45.8s/3m00.0s

running (1m47.0s), 200/200 VUs, 11324 complete and 0 interrupted iterations
default   [  59% ] 200/200 VUs  1m46.7s/3m00.0s

running (1m48.0s), 200/200 VUs, 11452 complete and 0 interrupted iterations
default   [  60% ] 200/200 VUs  1m47.7s/3m00.0s

running (1m49.0s), 200/200 VUs, 11575 complete and 0 interrupted iterations
default   [  60% ] 200/200 VUs  1m48.8s/3m00.0s

running (1m50.0s), 200/200 VUs, 11697 complete and 0 interrupted iterations
default   [  61% ] 200/200 VUs  1m49.8s/3m00.0s

running (1m51.0s), 200/200 VUs, 11817 complete and 0 interrupted iterations
default   [  62% ] 200/200 VUs  1m50.8s/3m00.0s

running (1m52.0s), 200/200 VUs, 11944 complete and 0 interrupted iterations
default   [  62% ] 200/200 VUs  1m51.8s/3m00.0s

running (1m53.0s), 200/200 VUs, 12081 complete and 0 interrupted iterations
default   [  63% ] 200/200 VUs  1m52.7s/3m00.0s

running (1m54.0s), 200/200 VUs, 12204 complete and 0 interrupted iterations
default   [  63% ] 200/200 VUs  1m53.7s/3m00.0s

running (1m55.0s), 200/200 VUs, 12330 complete and 0 interrupted iterations
default   [  64% ] 200/200 VUs  1m54.8s/3m00.0s

running (1m56.0s), 200/200 VUs, 12460 complete and 0 interrupted iterations
default   [  64% ] 200/200 VUs  1m55.8s/3m00.0s

running (1m57.0s), 200/200 VUs, 12581 complete and 0 interrupted iterations
default   [  65% ] 200/200 VUs  1m56.7s/3m00.0s

running (1m58.0s), 200/200 VUs, 12695 complete and 0 interrupted iterations
default   [  65% ] 200/200 VUs  1m57.8s/3m00.0s

running (1m59.0s), 200/200 VUs, 12824 complete and 0 interrupted iterations
default   [  66% ] 200/200 VUs  1m58.7s/3m00.0s

running (2m00.0s), 200/200 VUs, 12954 complete and 0 interrupted iterations
default   [  67% ] 200/200 VUs  1m59.8s/3m00.0s

running (2m01.0s), 200/200 VUs, 13077 complete and 0 interrupted iterations
default   [  67% ] 200/200 VUs  2m00.7s/3m00.0s

running (2m02.0s), 200/200 VUs, 13208 complete and 0 interrupted iterations
default   [  68% ] 200/200 VUs  2m01.8s/3m00.0s

running (2m03.0s), 200/200 VUs, 13314 complete and 0 interrupted iterations
default   [  68% ] 200/200 VUs  2m02.8s/3m00.0s

running (2m04.0s), 200/200 VUs, 13444 complete and 0 interrupted iterations
default   [  69% ] 200/200 VUs  2m03.8s/3m00.0s

running (2m05.0s), 200/200 VUs, 13578 complete and 0 interrupted iterations
default   [  69% ] 200/200 VUs  2m04.7s/3m00.0s

running (2m06.0s), 200/200 VUs, 13707 complete and 0 interrupted iterations
default   [  70% ] 200/200 VUs  2m05.7s/3m00.0s

running (2m07.0s), 200/200 VUs, 13819 complete and 0 interrupted iterations
default   [  70% ] 200/200 VUs  2m06.7s/3m00.0s

running (2m08.0s), 200/200 VUs, 13956 complete and 0 interrupted iterations
default   [  71% ] 200/200 VUs  2m07.8s/3m00.0s

running (2m09.0s), 200/200 VUs, 14079 complete and 0 interrupted iterations
default   [  72% ] 200/200 VUs  2m08.7s/3m00.0s

running (2m10.0s), 200/200 VUs, 14194 complete and 0 interrupted iterations
default   [  72% ] 200/200 VUs  2m09.8s/3m00.0s

running (2m11.0s), 200/200 VUs, 14332 complete and 0 interrupted iterations
default   [  73% ] 200/200 VUs  2m10.8s/3m00.0s

running (2m12.0s), 200/200 VUs, 14440 complete and 0 interrupted iterations
default   [  73% ] 200/200 VUs  2m11.7s/3m00.0s

running (2m13.0s), 200/200 VUs, 14575 complete and 0 interrupted iterations
default   [  74% ] 200/200 VUs  2m12.8s/3m00.0s

running (2m14.0s), 200/200 VUs, 14707 complete and 0 interrupted iterations
default   [  74% ] 200/200 VUs  2m13.8s/3m00.0s

running (2m15.0s), 200/200 VUs, 14827 complete and 0 interrupted iterations
default   [  75% ] 200/200 VUs  2m14.7s/3m00.0s

running (2m16.0s), 200/200 VUs, 14943 complete and 0 interrupted iterations
default   [  75% ] 200/200 VUs  2m15.7s/3m00.0s

running (2m17.0s), 200/200 VUs, 15082 complete and 0 interrupted iterations
default   [  76% ] 200/200 VUs  2m16.8s/3m00.0s

running (2m18.0s), 200/200 VUs, 15200 complete and 0 interrupted iterations
default   [  77% ] 200/200 VUs  2m17.8s/3m00.0s

running (2m19.0s), 200/200 VUs, 15332 complete and 0 interrupted iterations
default   [  77% ] 200/200 VUs  2m18.8s/3m00.0s

running (2m20.0s), 200/200 VUs, 15451 complete and 0 interrupted iterations
default   [  78% ] 200/200 VUs  2m19.7s/3m00.0s

running (2m21.0s), 200/200 VUs, 15594 complete and 0 interrupted iterations
default   [  78% ] 200/200 VUs  2m20.8s/3m00.0s

running (2m22.0s), 200/200 VUs, 15703 complete and 0 interrupted iterations
default   [  79% ] 200/200 VUs  2m21.8s/3m00.0s

running (2m23.0s), 200/200 VUs, 15829 complete and 0 interrupted iterations
default   [  79% ] 200/200 VUs  2m22.7s/3m00.0s

running (2m24.0s), 200/200 VUs, 15950 complete and 0 interrupted iterations
default   [  80% ] 200/200 VUs  2m23.8s/3m00.0s

running (2m25.0s), 200/200 VUs, 16081 complete and 0 interrupted iterations
default   [  80% ] 200/200 VUs  2m24.7s/3m00.0s

running (2m26.0s), 200/200 VUs, 16205 complete and 0 interrupted iterations
default   [  81% ] 200/200 VUs  2m25.8s/3m00.0s

running (2m27.0s), 200/200 VUs, 16333 complete and 0 interrupted iterations
default   [  82% ] 200/200 VUs  2m26.7s/3m00.0s

running (2m28.0s), 200/200 VUs, 16456 complete and 0 interrupted iterations
default   [  82% ] 200/200 VUs  2m27.8s/3m00.0s

running (2m29.0s), 200/200 VUs, 16580 complete and 0 interrupted iterations
default   [  83% ] 200/200 VUs  2m28.8s/3m00.0s

running (2m30.0s), 200/200 VUs, 16689 complete and 0 interrupted iterations
default   [  83% ] 200/200 VUs  2m29.8s/3m00.0s

running (2m31.0s), 199/200 VUs, 16792 complete and 0 interrupted iterations
default   [  84% ] 199/200 VUs  2m30.8s/3m00.0s

running (2m32.0s), 196/200 VUs, 16893 complete and 0 interrupted iterations
default   [  84% ] 196/200 VUs  2m31.8s/3m00.0s

running (2m33.0s), 189/200 VUs, 17031 complete and 0 interrupted iterations
default   [  85% ] 189/200 VUs  2m32.8s/3m00.0s

running (2m34.0s), 186/200 VUs, 17145 complete and 0 interrupted iterations
default   [  85% ] 186/200 VUs  2m33.7s/3m00.0s

running (2m35.0s), 174/200 VUs, 17271 complete and 0 interrupted iterations
default   [  86% ] 174/200 VUs  2m34.7s/3m00.0s

running (2m36.0s), 170/200 VUs, 17376 complete and 0 interrupted iterations
default   [  87% ] 170/200 VUs  2m35.7s/3m00.0s

running (2m37.0s), 160/200 VUs, 17493 complete and 0 interrupted iterations
default   [  87% ] 160/200 VUs  2m36.7s/3m00.0s

running (2m38.0s), 156/200 VUs, 17591 complete and 0 interrupted iterations
default   [  88% ] 156/200 VUs  2m37.8s/3m00.0s

running (2m39.0s), 148/200 VUs, 17690 complete and 0 interrupted iterations
default   [  88% ] 148/200 VUs  2m38.8s/3m00.0s

running (2m40.0s), 144/200 VUs, 17785 complete and 0 interrupted iterations
default   [  89% ] 144/200 VUs  2m39.8s/3m00.0s

running (2m41.0s), 134/200 VUs, 17872 complete and 0 interrupted iterations
default   [  89% ] 134/200 VUs  2m40.7s/3m00.0s

running (2m42.0s), 127/200 VUs, 17954 complete and 0 interrupted iterations
default   [  90% ] 127/200 VUs  2m41.8s/3m00.0s

running (2m43.0s), 121/200 VUs, 18037 complete and 0 interrupted iterations
default   [  90% ] 121/200 VUs  2m42.7s/3m00.0s

running (2m44.0s), 113/200 VUs, 18120 complete and 0 interrupted iterations
default   [  91% ] 113/200 VUs  2m43.8s/3m00.0s

running (2m45.0s), 109/200 VUs, 18190 complete and 0 interrupted iterations
default   [  92% ] 109/200 VUs  2m44.8s/3m00.0s

running (2m46.0s), 103/200 VUs, 18257 complete and 0 interrupted iterations
default   [  92% ] 103/200 VUs  2m45.8s/3m00.0s

running (2m47.0s), 094/200 VUs, 18318 complete and 0 interrupted iterations
default   [  93% ] 094/200 VUs  2m46.8s/3m00.0s

running (2m48.0s), 085/200 VUs, 18393 complete and 0 interrupted iterations
default   [  93% ] 085/200 VUs  2m47.7s/3m00.0s

running (2m49.0s), 078/200 VUs, 18444 complete and 0 interrupted iterations
default   [  94% ] 078/200 VUs  2m48.8s/3m00.0s

running (2m50.0s), 074/200 VUs, 18496 complete and 0 interrupted iterations
default   [  94% ] 074/200 VUs  2m49.7s/3m00.0s

running (2m51.0s), 069/200 VUs, 18539 complete and 0 interrupted iterations
default   [  95% ] 069/200 VUs  2m50.8s/3m00.0s

running (2m52.0s), 063/200 VUs, 18583 complete and 0 interrupted iterations
default   [  95% ] 063/200 VUs  2m51.7s/3m00.0s

running (2m53.0s), 056/200 VUs, 18621 complete and 0 interrupted iterations
default   [  96% ] 056/200 VUs  2m52.7s/3m00.0s

running (2m54.0s), 046/200 VUs, 18665 complete and 0 interrupted iterations
default   [  97% ] 046/200 VUs  2m53.7s/3m00.0s

running (2m55.0s), 043/200 VUs, 18691 complete and 0 interrupted iterations
default   [  97% ] 043/200 VUs  2m54.8s/3m00.0s

running (2m56.0s), 033/200 VUs, 18718 complete and 0 interrupted iterations
default   [  98% ] 033/200 VUs  2m55.7s/3m00.0s

running (2m57.0s), 029/200 VUs, 18741 complete and 0 interrupted iterations
default   [  98% ] 029/200 VUs  2m56.7s/3m00.0s

running (2m58.0s), 021/200 VUs, 18760 complete and 0 interrupted iterations
default   [  99% ] 021/200 VUs  2m57.8s/3m00.0s

running (2m59.0s), 013/200 VUs, 18776 complete and 0 interrupted iterations
default   [  99% ] 013/200 VUs  2m58.8s/3m00.0s

running (3m00.0s), 007/200 VUs, 18784 complete and 0 interrupted iterations
default   [ 100% ] 007/200 VUs  2m59.8s/3m00.0s

running (3m01.0s), 002/200 VUs, 18789 complete and 0 interrupted iterations
default ↓ [ 100% ] 007/200 VUs  3m0s

     ✗ conv list: status 200
      ↳  3% — ✓ 719 / ✗ 18072
     ✗ conv list: is array
      ↳  3% — ✓ 719 / ✗ 18072

     checks.........................: 3.82%  1438 out of 37582
   ✓ conv_list_duration.............: avg=3.25ms  min=0s       med=1ms      max=510ms    p(90)=3ms      p(95)=5ms     
   ✓ conv_messages_duration.........: avg=0s      min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     data_received..................: 30 MB  163 kB/s
     data_sent......................: 16 MB  87 kB/s
     http_req_blocked...............: avg=10.78µs min=2.03µs   med=6.02µs   max=15.18ms  p(90)=8.99µs   p(95)=10.48µs 
     http_req_connecting............: avg=2.12µs  min=0s       med=0s       max=15.01ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=3.09ms  min=347.77µs med=1.05ms   max=509.92ms p(90)=2.59ms   p(95)=4.41ms  
     ✓ { endpoint:conv_list }.......: avg=3.08ms  min=347.77µs med=1.05ms   max=509.92ms p(90)=2.59ms   p(95)=4.41ms  
     ✓ { endpoint:conv_messages }...: avg=0s      min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
       { expected_response:true }...: avg=6.03ms  min=2.07ms   med=4.4ms    max=132.2ms  p(90)=7.1ms    p(95)=9.84ms  
     http_req_failed................: 96.29% 36190 out of 37584
     ✗ { endpoint:conv_list }.......: 96.29% 36190 out of 37582
     ✓ { endpoint:conv_messages }...: 0.00%  0 out of 0
     http_req_receiving.............: avg=87.92µs min=18.25µs  med=65.42µs  max=55.76ms  p(90)=117.37µs p(95)=141.56µs
     http_req_sending...............: avg=28.16µs min=5.98µs   med=21.82µs  max=21.55ms  p(90)=37.85µs  p(95)=45.82µs 
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=2.97ms  min=313.45µs med=951.81µs max=509.88ms p(90)=2.44ms   p(95)=4.27ms  
     http_reqs......................: 37584  207.318421/s
     iteration_duration.............: avg=1.6s    min=602.86ms med=1.61s    max=2.99s    p(90)=2.4s     p(95)=2.5s    
     iterations.....................: 18791  103.653694/s
     vus............................: 2      min=2              max=200
     vus_max........................: 200    min=200            max=200


running (3m01.3s), 000/200 VUs, 18791 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/200 VUs  3m0s
time="2026-05-13T14:39:33Z" level=error msg="thresholds on metrics 'http_req_failed{endpoint:conv_list}' have been crossed"